<a href="https://colab.research.google.com/github/moyanke/inf1340-programmingfordatascience-fa22/blob/main/MID__Sub_YankeMo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [68]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly
df = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx')

In [69]:
table_01 = pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 1')
table_02= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 2')
table_03= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 3')
table_04= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 4')
table_05= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 5')
table_06= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='Table 6')
table_annex= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='ANNEX')
table_notes= pd.read_excel('/content/UN_MigrantStockTotal_2015.xlsx', sheet_name='NOTES')

In [ ]:
table_01

In [ ]:
table_1_1 = table_01.drop(table_01.index[0:15])
table_1_1 #Drop 0-15 rows

In [ ]:
table_1_1.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22'],
      dtype='object')

In [ ]:
table_1_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Migrant Stock Both Sex',
                  '1995 Migrant Stock Both Sex','2000 Migrant Stock Both Sex','2005 Migrant Stock Both Sex',
                  '2010 Migrant Stock Both Sex','2015 Migrant Stock Both Sex','1990 Migrant Stock Male',
                  '1995 Migrant Stock Male','2000 Migrant Stock Male','2005 Migrant Stock Male','2010 Migrant Stock Male',
                  '2015 Migrant Stock Male','1990 Migrant Stock Female','1995 Migrant Stock Female','2000 Migrant Stock Female',
                  '2005 Migrant Stock Female','2010 Migrant Stock Female',
                  '2015 Migrant Stock Female']

In [ ]:
table_1_1 #rename the columns

In [ ]:
tidy_table_01 = table_1_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Year",value_name="Migrant Stock")

In [ ]:
tidy_table_01

In [ ]:
tidy_table_01=(tidy_table_01.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[18:].astype(str)).drop("Year",axis=1))
tidy_table_01 #Separate the Year cloumns into year, gemder, migrant stock

##########Table_02##########

In [ ]:
table_02

In [ ]:
table_2_1 = table_02.drop(table_02.index[0:15])
table_2_1 #Drop 0-15 rows

In [83]:
table_2_1.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21'],
      dtype='object')

In [84]:
table_2_1.columns=['Order','Name of Area','Notes','Country Code','1990 Total Population Both Sex',
                  '1995 Total Population Both Sex','2000 Total Population Both Sex','2005 Total Population Both Sex',
                  '2010 Total Population Both Sex','2015 Total Population Both Sex','1990 Total Population Male',
                  '1995 Total Population Male','2000 Total Population Male','2005 Total Populatio Male','2010 Total Population Male',
                  '2015 Total Population Male','1990 Total Population Female','1995 Total Population Female','2000 Total Population Female',
                  '2005 Total Population Female','2010 Total Population Female',
                  '2015 Total Population Female']

In [ ]:
table_2_1

In [85]:
tidy_table_02 = table_2_1.melt(id_vars=["Order","Name of Area","Notes","Country Code"],var_name="Year",value_name="Total Population")

In [ ]:
tidy_table_02

In [86]:
tidy_table_02=(tidy_table_02.assign(year = lambda x: x.Year.str[:4].astype(str), Gender = lambda x: x.Year.str[22:].astype(str)).drop("Year",axis=1))
tidy_table_02 #Separate the Year cloumns into year, gemder, total population

,Order,Name of Area,Notes,Country Code,Total Population,year,Gender
0,1,WORLD,NaN,900,5309667.699,1990,Both Sex
1,2,Developed regions,(b),901,1144463.062,1990,Both Sex
2,3,Developing regions,(c),902,4165204.637,1990,Both Sex
3,4,Least developed countries,(d),941,510057.629,1990,Both Sex
4,5,Less developed regions excluding least develop...,NaN,934,3655147.008,1990,Both Sex
...,...,...,...,...,...,...,...
4765,261,Samoa,NaN,882,93.584,2015,Female
4766,262,Tokelau,NaN,772,..,2015,Female
4767,263,Tonga,NaN,776,52.931,2015,Female
4768,264,Tuvalu,NaN,798,..,2015,Female
4769,265,Wallis and Futuna Islands,NaN,876,..,2015,Female

maybe we can split 1990, 1995, 2000...into different column,based on the 
notebooks in the Guthub, can we used NaN in it.

In [ ]:
#write up of what violation you find, five page at least with picture. 
#use table_01.set_index("Name of area", inpplace = True)把name of area 变成中心指标

##########Table_03##########

In [ ]:
table_03

In [78]:
table_3_1 = table_03.drop(table_03.index[0:15])
table_3_1 #Drop 0-15 rows

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
15,1,WORLD,NaN,900,NaN,2.87331,2.803806,2.818899,2.933739,3.199467,...,2.849206,2.979124,3.280341,3.4019,2.83474,2.775658,2.788169,2.887645,3.117222,3.228342
16,2,Developed regions,(b),901,NaN,7.198015,7.891085,8.695688,9.693045,10.747765,...,8.743236,9.73154,10.680972,11.097807,7.147777,7.84948,8.650694,9.656595,10.811029,11.348476
17,3,Developing regions,(c),902,NaN,1.685021,1.500317,1.404022,1.395066,1.565106,...,1.490031,1.507122,1.746117,1.888268,1.595116,1.417459,1.315351,1.279428,1.378176,1.49061
18,4,Least developed countries,(d),941,NaN,2.171513,2.001353,1.516863,1.303078,1.182422,...,1.617552,1.432574,1.293264,1.35773,2.045276,1.901226,1.418405,1.175548,1.073428,1.148865
19,5,Less developed regions excluding least develop...,NaN,934,NaN,1.617042,1.426534,1.386338,1.410133,1.631865,...,1.470597,1.519189,1.823509,1.984593,1.530877,1.344872,1.299002,1.296941,1.432634,1.555397
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
275,261,Samoa,NaN,882,B,2.061216,2.758613,3.435005,3.1935,2.753334,...,3.410241,3.155014,2.703491,2.477821,2.037094,2.746419,3.461915,3.234843,2.806425,2.628654
276,262,Tokelau,NaN,772,B,16.780609,17.5,16.881443,21.322314,37.797357,...,..,..,..,..,..,..,..,..,..,..
277,263,Tonga,NaN,776,B,3.059316,3.414365,3.7631,4.264411,4.831308,...,3.97887,4.603156,5.23869,5.873514,3.033792,3.29138,3.539805,3.923713,4.422647,4.919612
278,264,Tuvalu,NaN,798,C,3.531764,2.850331,2.303854,1.887766,1.567111,...,..,..,..,..,..,..,..,..,..,..
279,265,Wallis and Futuna Islands,NaN,876,B,10.100865,11.878668,13.899427,16.601151,20.464431,...,..,..,..,..,..,..,..,..,..,..

In [97]:
table_3_1.columns=['Order','Name of Area','Notes','Country Code','Type of Data(a)','1990 Migrant Stock Percentage for Both Sex',
                  '1995 Migrant Stock Percentage for Both Sex','2000 Migrant Stock Percentage for Both Sex','2005 Migrant Stock Percentage for Both Sex',
                  '2010 Migrant Stock Percentage for Both Sex','2015 Migrant Stock Percentage for Both Sex','1990 Migrant Stock Percentage for Male',
                  '1995 Migrant Stock Percentage for Male','2000 Migrant Stock Percentage for Male','2005 Migrant Stock Percentage for Male','2010 Migrant Stock Percentage for Male',
                  '2015 Migrant Stock Percentage for Male','1990 Migrant Stock Percentage for Female','1995 Migrant Stock Percentage for Female','2000 Migrant Stock Percentage for Female',
                  '2005 Migrant Stock Percentage for Female','2010 Migrant Stock Percentage for Female',
                  '2015 Migrant Stock Percentage for Female']

In [ ]:
table_3_1

In [102]:
tidy_table_03 = table_3_1.melt(id_vars=["Order","Name of Area","Notes","Country Code","Type of Data(a)"],var_name="Years",value_name="International Migrant Stock as Percentage of Total Population")

In [94]:
tidy_table_03

,Order,Name of Area,Notes,Country Code,Type of Data(a),Years,International Migrant Stock as Percentage of Total Population
0,1,WORLD,NaN,900,NaN,1990 Migrant Stock Percentage for Both Sex,2.87331
1,2,Developed regions,(b),901,NaN,1990 Migrant Stock Percentage for Both Sex,7.198015
2,3,Developing regions,(c),902,NaN,1990 Migrant Stock Percentage for Both Sex,1.685021
3,4,Least developed countries,(d),941,NaN,1990 Migrant Stock Percentage for Both Sex,2.171513
4,5,Less developed regions excluding least develop...,NaN,934,NaN,1990 Migrant Stock Percentage for Both Sex,1.617042
...,...,...,...,...,...,...,...
4765,261,Samoa,NaN,882,B,2015 Migrant Stock Percentage for Female,2.628654
4766,262,Tokelau,NaN,772,B,2015 Migrant Stock Percentage for Female,..
4767,263,Tonga,NaN,776,B,2015 Migrant Stock Percentage for Female,4.919612
4768,264,Tuvalu,NaN,798,C,2015 Migrant Stock Percentage for Female,..
4769,265,Wallis and Futuna Islands,NaN,876,B,2015 Migrant Stock Percentage for Female,..

In [103]:
tidy_table_03=(tidy_table_03.assign(year = lambda x: x.Years.str[:4].astype(str), Gender = lambda x: x.Years.str[33:].astype(str)).drop("Years",axis=1))
tidy_table_03 #Separate the Year cloumns into year, gemder, migrant stock

,Order,Name of Area,Notes,Country Code,Type of Data(a),International Migrant Stock as Percentage of Total Population,year,Gender
0,1,WORLD,NaN,900,NaN,2.87331,1990,Both Sex
1,2,Developed regions,(b),901,NaN,7.198015,1990,Both Sex
2,3,Developing regions,(c),902,NaN,1.685021,1990,Both Sex
3,4,Least developed countries,(d),941,NaN,2.171513,1990,Both Sex
4,5,Less developed regions excluding least develop...,NaN,934,NaN,1.617042,1990,Both Sex
...,...,...,...,...,...,...,...,...
4765,261,Samoa,NaN,882,B,2.628654,2015,Female
4766,262,Tokelau,NaN,772,B,..,2015,Female
4767,263,Tonga,NaN,776,B,4.919612,2015,Female
4768,264,Tuvalu,NaN,798,C,..,2015,Female
4769,265,Wallis and Futuna Islands,NaN,876,B,..,2015,Female